----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]          15,616
             PReLU-2         [-1, 64, 256, 256]               1
            Conv2d-3         [-1, 64, 256, 256]          36,928
       BatchNorm2d-4         [-1, 64, 256, 256]             128
             PReLU-5         [-1, 64, 256, 256]               1
            Conv2d-6         [-1, 64, 256, 256]          36,928
       BatchNorm2d-7         [-1, 64, 256, 256]             128
             Block-8         [-1, 64, 256, 256]               0
            Conv2d-9         [-1, 64, 256, 256]          36,928
      BatchNorm2d-10         [-1, 64, 256, 256]             128
            PReLU-11         [-1, 64, 256, 256]               1
           Conv2d-12         [-1, 64, 256, 256]          36,928
      BatchNorm2d-13         [-1, 64, 256, 256]             128
            Block-14         [-1, 64, 256, 256]               0
           Conv2d-15         [-1, 64, 256, 256]          36,928
      BatchNorm2d-16         [-1, 64, 256, 256]             128
            PReLU-17         [-1, 64, 256, 256]               1
           Conv2d-18         [-1, 64, 256, 256]          36,928
      BatchNorm2d-19         [-1, 64, 256, 256]             128
            Block-20         [-1, 64, 256, 256]               0
           Conv2d-21         [-1, 64, 256, 256]          36,928
      BatchNorm2d-22         [-1, 64, 256, 256]             128
            PReLU-23         [-1, 64, 256, 256]               1
           Conv2d-24         [-1, 64, 256, 256]          36,928
      BatchNorm2d-25         [-1, 64, 256, 256]             128
            Block-26         [-1, 64, 256, 256]               0
           Conv2d-27         [-1, 64, 256, 256]          36,928
      BatchNorm2d-28         [-1, 64, 256, 256]             128
            PReLU-29         [-1, 64, 256, 256]               1
           Conv2d-30         [-1, 64, 256, 256]          36,928
      BatchNorm2d-31         [-1, 64, 256, 256]             128
            Block-32         [-1, 64, 256, 256]               0
           Conv2d-33         [-1, 64, 256, 256]          36,928
      BatchNorm2d-34         [-1, 64, 256, 256]             128
            PReLU-35         [-1, 64, 256, 256]               1
           Conv2d-36         [-1, 64, 256, 256]          36,928
      BatchNorm2d-37         [-1, 64, 256, 256]             128
            Block-38         [-1, 64, 256, 256]               0
           Conv2d-39         [-1, 64, 256, 256]          36,928
      BatchNorm2d-40         [-1, 64, 256, 256]             128
            PReLU-41         [-1, 64, 256, 256]               1
           Conv2d-42         [-1, 64, 256, 256]          36,928
      BatchNorm2d-43         [-1, 64, 256, 256]             128
            Block-44         [-1, 64, 256, 256]               0
           Conv2d-45         [-1, 64, 256, 256]          36,928
      BatchNorm2d-46         [-1, 64, 256, 256]             128
            PReLU-47         [-1, 64, 256, 256]               1
           Conv2d-48         [-1, 64, 256, 256]          36,928
      BatchNorm2d-49         [-1, 64, 256, 256]             128
            Block-50         [-1, 64, 256, 256]               0
           Conv2d-51         [-1, 64, 256, 256]          36,928
      BatchNorm2d-52         [-1, 64, 256, 256]             128
            PReLU-53         [-1, 64, 256, 256]               1
           Conv2d-54         [-1, 64, 256, 256]          36,928
      BatchNorm2d-55         [-1, 64, 256, 256]             128
            Block-56         [-1, 64, 256, 256]               0
           Conv2d-57         [-1, 64, 256, 256]          36,928
      BatchNorm2d-58         [-1, 64, 256, 256]             128
            PReLU-59         [-1, 64, 256, 256]               1
           Conv2d-60         [-1, 64, 256, 256]          36,928
      BatchNorm2d-61         [-1, 64, 256, 256]             128
            Block-62         [-1, 64, 256, 256]               0
           Conv2d-63         [-1, 64, 256, 256]          36,928
      BatchNorm2d-64         [-1, 64, 256, 256]             128
            PReLU-65         [-1, 64, 256, 256]               1
           Conv2d-66         [-1, 64, 256, 256]          36,928
      BatchNorm2d-67         [-1, 64, 256, 256]             128
            Block-68         [-1, 64, 256, 256]               0
           Conv2d-69         [-1, 64, 256, 256]          36,928
      BatchNorm2d-70         [-1, 64, 256, 256]             128
            PReLU-71         [-1, 64, 256, 256]               1
           Conv2d-72         [-1, 64, 256, 256]          36,928
      BatchNorm2d-73         [-1, 64, 256, 256]             128
            Block-74         [-1, 64, 256, 256]               0
           Conv2d-75         [-1, 64, 256, 256]          36,928
      BatchNorm2d-76         [-1, 64, 256, 256]             128
            PReLU-77         [-1, 64, 256, 256]               1
           Conv2d-78         [-1, 64, 256, 256]          36,928
      BatchNorm2d-79         [-1, 64, 256, 256]             128
            Block-80         [-1, 64, 256, 256]               0
           Conv2d-81         [-1, 64, 256, 256]          36,928
      BatchNorm2d-82         [-1, 64, 256, 256]             128
            PReLU-83         [-1, 64, 256, 256]               1
           Conv2d-84         [-1, 64, 256, 256]          36,928
      BatchNorm2d-85         [-1, 64, 256, 256]             128
            Block-86         [-1, 64, 256, 256]               0
           Conv2d-87         [-1, 64, 256, 256]          36,928
      BatchNorm2d-88         [-1, 64, 256, 256]             128
            PReLU-89         [-1, 64, 256, 256]               1
           Conv2d-90         [-1, 64, 256, 256]          36,928
      BatchNorm2d-91         [-1, 64, 256, 256]             128
            Block-92         [-1, 64, 256, 256]               0
           Conv2d-93         [-1, 64, 256, 256]          36,928
      BatchNorm2d-94         [-1, 64, 256, 256]             128
            PReLU-95         [-1, 64, 256, 256]               1
           Conv2d-96         [-1, 64, 256, 256]          36,928
      BatchNorm2d-97         [-1, 64, 256, 256]             128
            Block-98         [-1, 64, 256, 256]               0
           Conv2d-99         [-1, 64, 256, 256]          36,928
     BatchNorm2d-100         [-1, 64, 256, 256]             128
           PReLU-101         [-1, 64, 256, 256]               1
          Conv2d-102         [-1, 64, 256, 256]          36,928
     BatchNorm2d-103         [-1, 64, 256, 256]             128
           Block-104         [-1, 64, 256, 256]               0
          Conv2d-105         [-1, 64, 256, 256]          36,928
     BatchNorm2d-106         [-1, 64, 256, 256]             128
           PReLU-107         [-1, 64, 256, 256]               1
          Conv2d-108         [-1, 64, 256, 256]          36,928
     BatchNorm2d-109         [-1, 64, 256, 256]             128
           Block-110         [-1, 64, 256, 256]               0
          Conv2d-111         [-1, 64, 256, 256]          36,928
     BatchNorm2d-112         [-1, 64, 256, 256]             128
           PReLU-113         [-1, 64, 256, 256]               1
          Conv2d-114         [-1, 64, 256, 256]          36,928
     BatchNorm2d-115         [-1, 64, 256, 256]             128
           Block-116         [-1, 64, 256, 256]               0
          Conv2d-117         [-1, 64, 256, 256]          36,928
     BatchNorm2d-118         [-1, 64, 256, 256]             128
           PReLU-119         [-1, 64, 256, 256]               1
          Conv2d-120         [-1, 64, 256, 256]          36,928
     BatchNorm2d-121         [-1, 64, 256, 256]             128
           Block-122         [-1, 64, 256, 256]               0
          Conv2d-123         [-1, 64, 256, 256]          36,928
     BatchNorm2d-124         [-1, 64, 256, 256]             128
           PReLU-125         [-1, 64, 256, 256]               1
          Conv2d-126         [-1, 64, 256, 256]          36,928
     BatchNorm2d-127         [-1, 64, 256, 256]             128
           Block-128         [-1, 64, 256, 256]               0
          Conv2d-129         [-1, 64, 256, 256]          36,928
     BatchNorm2d-130         [-1, 64, 256, 256]             128
           PReLU-131         [-1, 64, 256, 256]               1
          Conv2d-132         [-1, 64, 256, 256]          36,928
     BatchNorm2d-133         [-1, 64, 256, 256]             128
           Block-134         [-1, 64, 256, 256]               0
          Conv2d-135        [-1, 256, 256, 256]         147,712
     BatchNorm2d-136        [-1, 256, 256, 256]             512
 ConvTranspose2d-137        [-1, 256, 512, 512]       1,048,832
          Conv2d-138        [-1, 256, 512, 512]         590,080
           PReLU-139        [-1, 256, 512, 512]               1
 ConvTranspose2d-140      [-1, 256, 1024, 1024]       1,048,832
          Conv2d-141       [-1, 64, 1024, 1024]         147,520
           PReLU-142       [-1, 64, 1024, 1024]               1
          Conv2d-143        [-1, 3, 1024, 1024]          15,555
================================================================
Total params: 4,645,148
Trainable params: 4,645,148
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 9176.00
Params size (MB): 17.72
Estimated Total Size (MB): 9194.47
----------------------------------------------------------------
